zephyrproject-rtos/zephyr/drivers/ieee802154/ieee802154_stm32wba.c
/* ieee802154_stm32wba.c - STM32WBxx 802.15.4 driver */

/*
 * Copyright (c) 2025 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <soc.h>
#include <errno.h>
#include <string.h>
#include <zephyr/arch/cpu.h>
#include <zephyr/debug/stack.h>
#include <zephyr/device.h>
#include <zephyr/init.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/net/net_if.h>
#include <zephyr/net/net_pkt.h>
#include <zephyr/sys/byteorder.h>

#if defined(CONFIG_NET_L2_OPENTHREAD)
#include <zephyr/net/openthread.h>
#include <zephyr/net/ieee802154_radio_openthread.h>
#endif /* CONFIG_NET_L2_OPENTHREAD */

#ifdef CONFIG_PM_DEVICE
#include <zephyr/pm/policy.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/pm.h>
#include "app_conf.h"
#include "linklayer_plat.h"
#include <stm32_ll_bus.h>
#include <stm32_ll_pwr.h>
#endif

#include <linklayer_plat_local.h>
#include <hci_if.h>
#include "ieee802154_stm32wba.h"
#include <stm32wba_802154_intf.h>

#define DT_DRV_COMPAT st_stm32wba_ieee802154

#define LOG_MODULE_NAME ieee802154_stm32wba

#define LOG_LEVEL _LOG_LEVEL_RESOLVE(CONFIG_IEEE802154_DRIVER_LOG_LEVEL)

LOG_MODULE_REGISTER(LOG_MODULE_NAME, LOG_LEVEL);

#if (SUPPORT_RADIO_SECURITY_OT_1_2 == 1)
#define STM32WBA_MAC_KEY_SIZE           16
#define STM32WBA_MAC_KEYS_ENTRIES_MAX   3
#define STM32WBA_MAC_KEY_PREV_INDEX     0
#define STM32WBA_MAC_KEY_CURR_INDEX     1
#define STM32WBA_MAC_KEY_NEXT_INDEX     2
#endif /* SUPPORT_RADIO_SECURITY_OT_1_2 */

extern uint32_t llhwc_cmn_is_dp_slp_enabled(void);
extern bool standby_entered;

static struct stm32wba_802154_data_t stm32wba_802154_data;
static volatile bool stm32wba_tx_wait_pending;
static volatile bool stm32wba_tx_abort_on_reset;

/* driver-allocated attribute memory - constant across all driver instances */
IEEE802154_DEFINE_PHY_SUPPORTED_CHANNELS(drv_attr, 11, 26);

#define NSEC_PER_TEN_SYMBOLS (10 * IEEE802154_PHY_OQPSK_780_TO_2450MHZ_SYMBOL_PERIOD_NS)

#define MAX_CSMA_BACKOFF 4
#define MAX_FRAME_RETRY  3
#define CCA_THRESHOLD    (-70)
/* Default maximum of energy detection */
#define DEFAULT_MAX_ED   (-36)
/* Default minimum of energy detection */
#define DEFAULT_MIN_ED   (-75)


static void stm32wba_802154_receive_done(uint8_t *p_buffer,
					 stm32wba_802154_ral_receive_done_metadata_t *p_metadata);
void stm32wba_802154_tx_ack_started(bool ack_fpb, bool ack_seb);
static void stm32wba_802154_transmit_done(
				uint8_t *p_frame,
				stm32wba_802154_ral_error_t error,
				const stm32wba_802154_ral_transmit_done_metadata_t *p_metadata);
static void stm32wba_802154_cca_done(stm32wba_802154_ral_error_t error);
static void stm32wba_802154_energy_scan_done(int8_t ed_result);

static const struct device *stm32wba_802154_get_device(void)
{
	LOG_DBG("Getting device instance");

	return net_if_get_device(stm32wba_802154_data.iface);
}

static void stm32wba_802154_get_eui64(uint8_t *mac)
{
	stm32wba_802154_ral_eui64_get(mac);

	LOG_DBG("Device EUI64: %02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x",
		mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
}

static void stm32wba_802154_rx_thread(void *arg1, void *arg2, void *arg3)
{
	struct stm32wba_802154_data_t *stm32wba_radio = (struct stm32wba_802154_data_t *)arg1;
	struct net_pkt *pkt;
	struct stm32wba_802154_rx_frame *rx_frame;
	uint8_t pkt_len;

	ARG_UNUSED(arg2);
	ARG_UNUSED(arg3);

	LOG_DBG("RX thread started");

	while (1) {
		pkt = NULL;

		rx_frame = k_fifo_get(&stm32wba_radio->rx_fifo, K_FOREVER);

		__ASSERT_NO_MSG(rx_frame->psdu != NULL);

		/* The length is supplied by the radio firmware; reject one that
		 * cannot hold the FCS before subtracting it.
		 */
		if (rx_frame->length < IEEE802154_FCS_LENGTH) {
			LOG_ERR("Invalid frame length %u", rx_frame->length);
			rx_frame->psdu = NULL;
			continue;
		}

		/* Depending on the net L2 layer, the FCS may be included in length or not */
		if (IS_ENABLED(CONFIG_IEEE802154_L2_PKT_INCL_FCS)) {
			pkt_len = rx_frame->length;
		} else {
			pkt_len = rx_frame->length - IEEE802154_FCS_LENGTH;
		}

#if defined(CONFIG_NET_BUF_DATA_SIZE)
		if (pkt_len > CONFIG_NET_BUF_DATA_SIZE) {
			LOG_ERR("Frame too long: %u", pkt_len);
			rx_frame->psdu = NULL;
			continue;
		}
#endif

		LOG_DBG("Frame received - sequence nb: %u, length: %u", rx_frame->psdu[2],
			pkt_len);

		/* Block the RX thread until net_pkt is available, so that we
		 * don't drop already ACKed frame in case of temporary net_pkt
		 * scarcity. The STM32WBA 802154 radio driver will accumulate any
		 * incoming frames until it runs out of internal buffers (and
		 * thus stops acknowledging consecutive frames).
		 */
		pkt = net_pkt_rx_alloc_with_buffer(stm32wba_radio->iface, pkt_len,
						   NET_AF_UNSPEC, 0, K_FOREVER);

		if (net_pkt_write(pkt, rx_frame->psdu, pkt_len) != 0) {
			LOG_ERR("Failed to write packet data");
			net_pkt_unref(pkt);
		} else {
			net_pkt_set_ieee802154_lqi(pkt, rx_frame->lqi);
			net_pkt_set_ieee802154_rssi_dbm(pkt, rx_frame->rssi);
			net_pkt_set_ieee802154_ack_fpb(pkt, rx_frame->ack_fpb);

#if defined(CONFIG_NET_L2_OPENTHREAD)
			net_pkt_set_ieee802154_ack_seb(pkt, rx_frame->ack_seb);
#endif /* CONFIG_NET_L2_OPENTHREAD */

			if (net_recv_data(stm32wba_radio->iface, pkt) < 0) {
				LOG_ERR("Packet dropped by NET stack");
				net_pkt_unref(pkt);
			} else {
				if (LOG_LEVEL >= LOG_LEVEL_DBG) {
					log_stack_usage(&stm32wba_radio->rx_thread);
				}
			}
		}
		rx_frame->psdu = NULL;
	}
}

static void stm32wba_802154_receive_failed(stm32wba_802154_ral_error_t error)
{
	const struct device *dev = stm32wba_802154_get_device();
	enum ieee802154_rx_fail_reason reason;

	switch (error) {
	case STM32WBA_802154_RAL_ERROR_FCS:
		reason = IEEE802154_RX_FAIL_INVALID_FCS;
		break;
	case STM32WBA_802154_RAL_ERROR_NO_FRAME_RECEIVED:
		reason = IEEE802154_RX_FAIL_NOT_RECEIVED;
		break;
	case STM32WBA_802154_RAL_ERROR_DESTINATION_ADDRESS_FILTERED:
		reason = IEEE802154_RX_FAIL_ADDR_FILTERED;
		break;
	default:
		reason = IEEE802154_RX_FAIL_OTHER;
		break;
	}

	if (IS_ENABLED(CONFIG_IEEE802154_STM32WBA_LOG_RX_FAILURES)) {
		LOG_INF("Receive failed, error = %d", error);
	}

	stm32wba_802154_data.last_frame_ack_fpb = false;
	stm32wba_802154_data.last_frame_ack_seb = false;

	if (stm32wba_802154_data.event_handler != NULL) {
		stm32wba_802154_data.event_handler(dev, IEEE802154_EVENT_RX_FAILED, &reason);
	}
}

