zephyrproject-rtos/zephyr/drivers/ieee802154/ieee802154_stm32wba.c
#if defined(CONFIG_NET_L2_CUSTOM_IEEE802154)
static int stm32wba_802154_configure_extended(enum ieee802154_stm32wba_config_type type,
					      const struct ieee802154_stm32wba_config *config)
{
	stm32wba_802154_ral_error_t ret;

	switch (type) {
	case IEEE802154_STM32WBA_CONFIG_CCA_THRESHOLD:
		LOG_DBG("Setting CCA_THRESHOLD: %d", config->cca_thr);
		ret = stm32wba_802154_ral_set_cca_energy_detect_threshold(config->cca_thr);
		if (ret != STM32WBA_802154_RAL_ERROR_NONE) {
			return -EIO;
		}
		break;

	case IEEE802154_STM32WBA_CONFIG_CONTINUOUS_RECEPTION:
		LOG_DBG("Setting CONTINUOUS_RECEPTION: %u", config->en_cont_rec);
		stm32wba_802154_ral_set_continuous_reception(config->en_cont_rec);
		break;

	case IEEE802154_STM32WBA_CONFIG_MAX_FRAME_RETRIES:
		LOG_DBG("Setting MAX_FRAME_RETRIES: %u", config->max_frm_retries);
		stm32wba_802154_ral_set_max_frame_retries(config->max_frm_retries);
		break;

	case IEEE802154_STM32WBA_CONFIG_MAX_CSMA_FRAME_RETRIES:
		LOG_DBG("Setting MAX_CSMA_FRAME_RETRIES: %u", config->max_csma_frm_retries);
		stm32wba_802154_ral_set_max_csma_frame_retries(config->max_csma_frm_retries);
		break;

	case IEEE802154_STM32WBA_CONFIG_MIN_CSMA_BE:
		LOG_DBG("Setting MIN_CSMA_BE: %u", config->min_csma_be);
		stm32wba_802154_ral_set_min_csma_be(config->min_csma_be);
		break;

	case IEEE802154_STM32WBA_CONFIG_MAX_CSMA_BE:
		LOG_DBG("Setting MAX_CSMA_BE: %u", config->max_csma_be);
		stm32wba_802154_ral_set_max_csma_be(config->max_csma_be);
		break;

	case IEEE802154_STM32WBA_CONFIG_MAX_CSMA_BACKOFF:
		LOG_DBG("Setting MAX_CSMA_BACKOFF: %u", config->max_csma_backoff);
		stm32wba_802154_ral_set_max_csma_backoff(config->max_csma_backoff);
		break;

	case IEEE802154_STM32WBA_CONFIG_IMPLICIT_BROADCAST:
		LOG_DBG("Setting IMPLICIT_BROADCAST: %u", config->impl_brdcast);
		stm32wba_802154_ral_set_implicitbroadcast(config->impl_brdcast);
		break;

	case IEEE802154_STM32WBA_CONFIG_ANTENNA_DIV:
		LOG_DBG("Setting ANTENNA_DIV: %u", config->ant_div);
		ret = stm32wba_802154_ral_set_ant_div_enable(config->ant_div);
		if (ret != STM32WBA_802154_RAL_ERROR_NONE) {
			return -EIO;
		}
		break;

	case IEEE802154_STM32WBA_CONFIG_RADIO_RESET:
		LOG_DBG("Setting RADIO_RESET");
		/* Unblock any waiter and mark current TX as aborted. */
		stm32wba_tx_abort_on_reset = true;
		stm32wba_tx_wait_pending = false;
		stm32wba_802154_data.tx_result = STM32WBA_802154_RAL_ERROR_ABORT;
		stm32wba_802154_data.tx_psdu_from_tx_done = false;
		stm32wba_802154_data.ack_frame.psdu = NULL;
		stm32wba_802154_data.ack_frame.length = 0;

		ret = stm32wba_802154_ral_radio_reset();
		if (ret != STM32WBA_802154_RAL_ERROR_NONE) {
			return -EIO;
		}
		break;

	default:
		LOG_ERR("Unsupported configuration type: %d", type);
		return -EINVAL;
	}

	return 0;
}

static int stm32wba_802154_attr_get_extended(enum ieee802154_stm32wba_attr attr,
					     struct ieee802154_stm32wba_attr_value *value)
{
	stm32wba_802154_ral_error_t ret;

	switch ((uint32_t)attr) {
	case IEEE802154_STM32WBA_ATTR_CCA_THRESHOLD:
		static int8_t l_cca_thr;

		LOG_DBG("Getting CCA_THRESHOLD attribute");
		ret = stm32wba_802154_ral_get_cca_energy_detect_threshold(&l_cca_thr);
		if (ret != STM32WBA_802154_RAL_ERROR_NONE) {
			return -ENOENT;
		}
		value->cca_thr = &l_cca_thr;
		break;

	case IEEE802154_STM32WBA_ATTR_IEEE_EUI64:
		uint8_t l_eui64[sizeof(value->eui64)];

		LOG_DBG("Getting IEEE_EUI64 attribute");
		stm32wba_802154_get_eui64(l_eui64);
		memcpy(value->eui64, l_eui64, sizeof(l_eui64));
		break;

	case IEEE802154_STM32WBA_ATTR_TX_POWER:
		static uint8_t l_tx_power;

		LOG_DBG("Getting TX_POWER attribute");
		ret = stm32wba_802154_ral_tx_power_get(&l_tx_power);
		if (ret != STM32WBA_802154_RAL_ERROR_NONE) {
			return -ENOENT;
		}
		value->tx_power = &l_tx_power;
		break;

	case IEEE802154_STM32WBA_ATTR_RAND_NUM:
		static uint8_t l_rand_num;

		LOG_DBG("Getting RAND_NUM attribute");
		ret = stm32wba_802154_ral_mac_gen_rnd_num(&l_rand_num, 1, true);
		if (ret != STM32WBA_802154_RAL_ERROR_NONE) {
			return -ENOENT;
		}
		value->rand_num = &l_rand_num;
		break;

	default:
		LOG_ERR("Unsupported attribute: %u", attr);
		return -ENOENT;
	}

	return 0;
}
#endif


/* Radio device API */

static enum ieee802154_hw_caps stm32wba_802154_get_capabilities(const struct device *dev)
{
	ARG_UNUSED(dev);

	return IEEE802154_HW_ENERGY_SCAN |
		IEEE802154_HW_FCS |
		IEEE802154_HW_FILTER |
		IEEE802154_HW_PROMISC |
#ifdef CONFIG_IEEE802154_STM32WBA_CSMA_CA_ENABLED
		IEEE802154_HW_CSMA |
#endif
		IEEE802154_HW_TX_RX_ACK |
		IEEE802154_HW_RETRANSMISSION |
		IEEE802154_HW_RX_TX_ACK |
#if (STM32WBA_802154_CSL_TRANSMITTER_ENABLE == 1)
		IEEE802154_HW_TXTIME |
#endif
#if (STM32WBA_802154_CSL_RECEIVER_ENABLE == 1)
		IEEE802154_HW_RXTIME |
#endif
#if (SUPPORT_RADIO_SECURITY_OT_1_2 == 1)
		IEEE802154_HW_TX_SEC |
#endif
		IEEE802154_RX_ON_WHEN_IDLE;
}

static int stm32wba_802154_cca(const struct device *dev)
{
	struct stm32wba_802154_data_t *stm32wba_radio = dev->data;

	if (stm32wba_802154_ral_cca() != STM32WBA_802154_RAL_ERROR_NONE) {
		LOG_DBG("CCA failed");
		return -EBUSY;
	}

	/* The STM32WBA driver guarantees that a callback will be called once
	 * the CCA function is done, thus unlocking the semaphore.
	 */
	k_sem_take(&stm32wba_radio->cca_wait, K_FOREVER);

	LOG_DBG("Channel free? %d", stm32wba_radio->channel_free);

	return stm32wba_radio->channel_free ? 0 : -EBUSY;
}

static int stm32wba_802154_set_channel(const struct device *dev, uint16_t channel)
{
	ARG_UNUSED(dev);

	if (channel < drv_attr.phy_channel_range.from_channel ||
	    channel > drv_attr.phy_channel_range.to_channel) {
		LOG_ERR("Invalid channel: %u (valid range: %u to %u)", channel,
			drv_attr.phy_channel_range.from_channel,
			drv_attr.phy_channel_range.to_channel);
		return channel < drv_attr.phy_channel_range.from_channel ? -ENOTSUP : -EINVAL;
	}

	LOG_DBG("Setting channel %u", channel);
	stm32wba_802154_ral_set_channel(channel);

	stm32wba_802154_data.channel = channel;

	return 0;
}

static int stm32wba_802154_energy_scan_start(const struct device *dev,
					     uint16_t duration,
					     energy_scan_done_cb_t done_cb)
{
	int err = 0;
	stm32wba_802154_ral_error_t ret;

	ARG_UNUSED(dev);

	LOG_DBG("Starting energy scan with duration: %u ms", duration);

	if (stm32wba_802154_data.energy_scan_done_cb == NULL) {
		stm32wba_802154_data.energy_scan_done_cb = done_cb;
		ret = stm32wba_802154_ral_energy_detection(duration);
		if (ret != STM32WBA_802154_RAL_ERROR_NONE) {
			LOG_ERR("Energy detection failed, device is busy");
			stm32wba_802154_data.energy_scan_done_cb = NULL;
			err = -EBUSY;
		}
	} else {
		LOG_ERR("Energy scan already in progress");
		err = -EALREADY;
	}

