zephyrproject-rtos/zephyr/drivers/ieee802154/ieee802154_stm32wba.c
	return err;
}

static int stm32wba_802154_filter(const struct device *dev, bool set,
				  enum ieee802154_filter_type type,
				  const struct ieee802154_filter *filter)
{
	int err = 0;

	if (!set) {
		LOG_ERR("Filter unset, operation is not supported");
		return -ENOTSUP;
	}

	switch (type) {
	case IEEE802154_FILTER_TYPE_IEEE_ADDR:
		LOG_DBG("Setting extended address filter to "
			"%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x",
			filter->ieee_addr[0], filter->ieee_addr[1], filter->ieee_addr[2],
			filter->ieee_addr[3], filter->ieee_addr[4], filter->ieee_addr[5],
			filter->ieee_addr[6], filter->ieee_addr[7]);
		stm32wba_802154_ral_extended_address_set(filter->ieee_addr);
		break;

	case IEEE802154_FILTER_TYPE_SHORT_ADDR:
		LOG_DBG("Setting short address filter to 0x%04x", filter->short_addr);
		stm32wba_802154_ral_short_address_set(filter->short_addr);
		break;

	case IEEE802154_FILTER_TYPE_PAN_ID:
		LOG_DBG("Setting PAN ID filter to 0x%04x", filter->pan_id);
		stm32wba_802154_ral_pan_id_set(filter->pan_id);
		break;

	default:
		LOG_ERR("Unsupported filter type: %u", type);
		err = -ENOTSUP;
		break;
	}

	return err;
}

static int stm32wba_802154_set_txpower(const struct device *dev, int16_t dbm)
{
	ARG_UNUSED(dev);

	if (!IN_RANGE(dbm, STM32WBA_PWR_MIN, STM32WBA_PWR_MAX)) {
		LOG_ERR("Invalid TX power: %d dBm (valid range: %d to %d dBm)",
			dbm, STM32WBA_PWR_MIN, STM32WBA_PWR_MAX);
		return -EINVAL;
	}

	stm32wba_802154_ral_tx_power_set(dbm);
	stm32wba_802154_data.txpwr = dbm;

	LOG_DBG("Setting TX power to %d dBm", dbm);

	return 0;
}

static int handle_ack(struct stm32wba_802154_data_t *stm32wba_radio)
{
	uint8_t ack_len;
	struct net_pkt *ack_pkt;
	int err = 0;

	if (IS_ENABLED(CONFIG_IEEE802154_L2_PKT_INCL_FCS)) {
		ack_len = stm32wba_radio->ack_frame.length;
	} else {
		ack_len = stm32wba_radio->ack_frame.length - IEEE802154_FCS_LENGTH;
	}

	ack_pkt = net_pkt_rx_alloc_with_buffer(stm32wba_radio->iface, ack_len,
					       NET_AF_UNSPEC, 0, K_NO_WAIT);
	if (ack_pkt == NULL) {
		LOG_ERR("No free packet available.");
		return -ENOMEM;
	}

	if (net_pkt_write(ack_pkt, stm32wba_radio->ack_frame.psdu, ack_len) < 0) {
		LOG_ERR("Failed to write to a packet.");
		err = -ENOMEM;
		goto free_net_ack;
	}

	net_pkt_set_ieee802154_lqi(ack_pkt, stm32wba_radio->ack_frame.lqi);
	net_pkt_set_ieee802154_rssi_dbm(ack_pkt, stm32wba_radio->ack_frame.rssi);

	net_pkt_cursor_init(ack_pkt);

	if (ieee802154_handle_ack(stm32wba_radio->iface, ack_pkt) != NET_OK) {
		LOG_WRN("ACK packet not handled - releasing.");
	} else {
		LOG_DBG("ACK packet received - sequence nb: %u",
			stm32wba_radio->ack_frame.psdu[2]);
	}

free_net_ack:
	net_pkt_unref(ack_pkt);

	return err;
}

static void stm32wba_802154_tx_started(const struct device *dev,
				       struct net_pkt *pkt,
				       struct net_buf *frag)
{
	ARG_UNUSED(pkt);

	if (stm32wba_802154_data.event_handler != NULL) {
		stm32wba_802154_data.event_handler(dev, IEEE802154_EVENT_TX_STARTED, frag);
	}
}

static stm32wba_802154_ral_error_t stm32wba_802154_transmit(struct net_pkt *pkt,
					       uint8_t *payload, uint8_t payload_len, bool cca)
{
	LOG_DBG("TX frame - sequence nb: %u, length: %u", payload[2], payload_len);

	stm32wba_802154_ral_transmit_metadata_t metadata = {
		.is_secured = net_pkt_ieee802154_frame_secured(pkt),
		.dynamic_data_is_set = net_pkt_ieee802154_mac_hdr_rdy(pkt),
		.cca = cca,
		.tx_power = stm32wba_802154_data.txpwr,
		.tx_channel = stm32wba_802154_ral_channel_get()
	};

	return stm32wba_802154_ral_transmit(payload, payload_len, &metadata);
}

static int stm32wba_802154_tx(const struct device *dev,
			      enum ieee802154_tx_mode mode,
			      struct net_pkt *pkt,
			      struct net_buf *frag)
{
	uint8_t payload_len = frag->len + IEEE802154_FCS_LENGTH;
	uint8_t *payload = frag->data;
	stm32wba_802154_ral_error_t err;

	if (payload_len > IEEE802154_MTU + IEEE802154_FCS_LENGTH) {
		LOG_ERR("Payload too large: %d", payload_len);
		return -EMSGSIZE;
	}

	memcpy(stm32wba_802154_data.tx_psdu, payload, payload_len);
	stm32wba_802154_data.tx_psdu_len = payload_len;
	stm32wba_802154_data.tx_psdu_from_tx_done = false;
	stm32wba_tx_abort_on_reset = false;

	/* Reset semaphore in case ACK was received after timeout */
	k_sem_reset(&stm32wba_802154_data.tx_wait);

	stm32wba_tx_wait_pending = true;

	switch (mode) {
	case IEEE802154_TX_MODE_DIRECT:
	case IEEE802154_TX_MODE_CCA:
		err = stm32wba_802154_transmit(pkt,
					       stm32wba_802154_data.tx_psdu,
					       payload_len,
					       false);
		break;
#ifdef CONFIG_IEEE802154_STM32WBA_CSMA_CA_ENABLED
	case IEEE802154_TX_MODE_CSMA_CA:
		err = stm32wba_802154_transmit(pkt,
					       stm32wba_802154_data.tx_psdu,
					       payload_len,
					       true);
		break;
#endif
	default:
		LOG_ERR("TX mode %d not supported", mode);
		return -ENOTSUP;
	}

	if (err != STM32WBA_802154_RAL_ERROR_NONE) {
		stm32wba_tx_wait_pending = false;
		LOG_ERR("Cannot send frame");
		return -EIO;
	}

	stm32wba_802154_tx_started(dev, pkt, frag);

	/* Wait for the callback from the radio driver. */
	k_sem_take(&stm32wba_802154_data.tx_wait, K_FOREVER);

	stm32wba_tx_wait_pending = false;

	/* Propagate tx_done frame updates whenever callback provides frame bytes. */
	if (stm32wba_802154_data.tx_psdu_from_tx_done &&
	    (stm32wba_802154_data.tx_psdu_len <= payload_len)) {
		memcpy(payload, stm32wba_802154_data.tx_psdu, stm32wba_802154_data.tx_psdu_len);
	}

	LOG_DBG("Transmit done, result: %d", stm32wba_802154_data.tx_result);

	net_pkt_set_ieee802154_frame_secured(pkt, stm32wba_802154_data.tx_frame_is_secured);
	net_pkt_set_ieee802154_mac_hdr_rdy(pkt, stm32wba_802154_data.tx_frame_mac_hdr_rdy);

	switch (stm32wba_802154_data.tx_result) {
	case STM32WBA_802154_RAL_ERROR_NONE:
		if (stm32wba_802154_data.ack_frame.psdu == NULL) {
			/* No ACK was requested. */
			return 0;
		}
		/* Handle ACK packet. */
		return handle_ack(&stm32wba_802154_data);
	case STM32WBA_802154_RAL_ERROR_NO_BUFS:
		return -ENOBUFS;
	case STM32WBA_802154_RAL_ERROR_CHANNEL_ACCESS_FAILURE:
		return -EBUSY;
	case STM32WBA_802154_RAL_ERROR_NO_ACK:
		return -ENOMSG;
	case STM32WBA_802154_RAL_ERROR_ABORT:
	default:
		return -EIO;
	}
}

static net_time_t stm32wba_802154_get_time(const struct device *dev)
{
	ARG_UNUSED(dev);

	return (net_time_t)stm32wba_802154_ral_time_get() * NSEC_PER_USEC;
}

static uint8_t stm32wba_802154_get_acc(const struct device *dev)
{
	ARG_UNUSED(dev);

