zephyrproject-rtos/zephyr/drivers/ieee802154/ieee802154_stm32wba.c
	return CONFIG_IEEE802154_STM32WBA_DELAY_TRX_ACC;
}

static int stm32wba_802154_start(const struct device *dev)
{
	ARG_UNUSED(dev);

	/* Set Channel */
	stm32wba_802154_ral_set_channel(stm32wba_802154_data.channel);

	stm32wba_802154_ral_tx_power_set(stm32wba_802154_data.txpwr);

	/* Configure continuous reception mode */
	stm32wba_802154_ral_set_continuous_reception(stm32wba_802154_data.rx_on_when_idle);

	/* Set the radio in Receive State */
	if (stm32wba_802154_ral_receive() != STM32WBA_802154_RAL_ERROR_NONE) {
		LOG_ERR("Failed to enter receive state");
		return -EIO;
	}

	LOG_DBG("802.15.4 radio started on channel: %u",
		stm32wba_802154_ral_channel_get());

	return 0;
}

static int stm32wba_802154_stop(const struct device *dev)
{
	ARG_UNUSED(dev);

	/* Disable continuous reception mode */
	stm32wba_802154_ral_set_continuous_reception(false);

	/* Set the radio in Sleep state */
	if (stm32wba_802154_ral_sleep() != STM32WBA_802154_RAL_ERROR_NONE) {
		LOG_ERR("Error while stopping radio");
		return -EIO;
	}

	LOG_DBG("802.15.4 radio stopped");

	return 0;
}

static int stm32wba_802154_driver_init(const struct device *dev)
{
	ARG_UNUSED(dev);

	/* Initialization of the thread dedicated to Link Layer Controller IP */
	stm32wba_ll_ctlr_thread_init();

	k_fifo_init(&stm32wba_802154_data.rx_fifo);
	k_sem_init(&stm32wba_802154_data.tx_wait, 0, 1);
	k_sem_init(&stm32wba_802154_data.cca_wait, 0, 1);
#if defined(CONFIG_NET_L2_OPENTHREAD)
	stm32wba_802154_ral_set_config_lib_params(1, 0);
#else
	stm32wba_802154_ral_set_config_lib_params(0, 1);
#endif /* CONFIG_NET_L2_OPENTHREAD */
	stm32wba_802154_ral_init();
	stm32wba_802154_ral_promiscuous_set(false);
#if !defined(CONFIG_NET_L2_CUSTOM_IEEE802154_STM32WBA) && !defined(CONFIG_NET_L2_OPENTHREAD)
	stm32wba_802154_data.rx_on_when_idle = true;
#else
	stm32wba_802154_data.rx_on_when_idle = false;
#endif /* CONFIG_NET_L2_CUSTOM_IEEE802154_STM32WBA && CONFIG_NET_L2_OPENTHREAD */
	stm32wba_802154_ral_set_continuous_reception(stm32wba_802154_data.rx_on_when_idle);

	stm32wba_802154_data.channel = 0;

	k_thread_create(&stm32wba_802154_data.rx_thread, stm32wba_802154_data.rx_stack,
			CONFIG_IEEE802154_STM32WBA_RX_STACK_SIZE,
			stm32wba_802154_rx_thread, &stm32wba_802154_data, NULL, NULL,
			K_PRIO_COOP(2), 0, K_NO_WAIT);

	k_thread_name_set(&stm32wba_802154_data.rx_thread, "stm32wba_rx");

	LOG_DBG("STM32WBA 802.15.4 radio initialized");

	return 0;
}

static void stm32wba_802154_iface_init(struct net_if *iface)
{
	static struct stm32wba_802154_ral_cbk_dispatch_tbl ll_cbk_dispatch_tbl = {
		.stm32wba_802154_ral_cbk_ed_scan_done = stm32wba_802154_energy_scan_done,
		.stm32wba_802154_ral_cbk_tx_done = stm32wba_802154_transmit_done,
		.stm32wba_802154_ral_cbk_rx_done = stm32wba_802154_receive_done,
		.stm32wba_802154_ral_cbk_cca_done = stm32wba_802154_cca_done,
		.stm32wba_802154_ral_cbk_tx_ack_started = stm32wba_802154_tx_ack_started,
	};

	link_layer_register_isr();

#if !defined(CONFIG_NET_L2_CUSTOM_IEEE802154_STM32WBA)
	ll_sys_thread_init();
	/* Intentionally discard the return values */
	(void)stm32wba_802154_ral_set_max_csma_backoff(MAX_CSMA_BACKOFF);
	(void)stm32wba_802154_ral_set_max_frame_retries(MAX_FRAME_RETRY);
	(void)stm32wba_802154_ral_set_cca_energy_detect_threshold(CCA_THRESHOLD);
#endif
	stm32wba_802154_ral_call_back_funcs_init(&ll_cbk_dispatch_tbl);

	stm32wba_802154_get_eui64(stm32wba_802154_data.mac);
	net_if_set_link_addr(iface, stm32wba_802154_data.mac,
				sizeof(stm32wba_802154_data.mac), NET_LINK_IEEE802154);

	stm32wba_802154_data.iface = iface;

	ieee802154_init(iface);

#if defined(CONFIG_NET_L2_CUSTOM_IEEE802154_STM32WBA)
	ll_sys_mac_cntrl_init();
#endif
}

static int stm32wba_802154_set_ack_fpb(const struct ieee802154_config *config)
{
	int err = 0;
	stm32wba_802154_ral_error_t ret;

	if (config->ack_fpb.extended) {
		ret = stm32wba_802154_ral_pending_bit_for_ext_addr_set(
							(const uint8_t *)config->ack_fpb.addr);
		if (ret != STM32WBA_802154_RAL_ERROR_NONE) {
			LOG_ERR("Failed to set ACK_FPB for extended address: "
				"%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x",
				config->ack_fpb.addr[0], config->ack_fpb.addr[1],
				config->ack_fpb.addr[2], config->ack_fpb.addr[3],
				config->ack_fpb.addr[4], config->ack_fpb.addr[5],
				config->ack_fpb.addr[6], config->ack_fpb.addr[7]);
			err = -ENOMEM;
		} else {
			LOG_DBG("Set ACK_FPB for extended address: "
				"%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x",
				config->ack_fpb.addr[0], config->ack_fpb.addr[1],
				config->ack_fpb.addr[2], config->ack_fpb.addr[3],
				config->ack_fpb.addr[4], config->ack_fpb.addr[5],
				config->ack_fpb.addr[6], config->ack_fpb.addr[7]);
		}
	} else {
		uint16_t short_addr = (uint16_t)config->ack_fpb.addr[0] |
				      (uint16_t)(config->ack_fpb.addr[1] << 8);

		ret = stm32wba_802154_ral_pending_bit_for_short_addr_set(short_addr);
		if (ret != STM32WBA_802154_RAL_ERROR_NONE) {
			LOG_ERR("Failed to set ACK_FPB for short address: 0x%02X%02X",
				config->ack_fpb.addr[1],
				config->ack_fpb.addr[0]);
			err = -ENOMEM;
		} else {
			LOG_DBG("Set ACK_FPB for short address: 0x%02X%02X",
				config->ack_fpb.addr[1],
				config->ack_fpb.addr[0]);
		}
	}
	return err;
}

static int stm32wba_802154_clear_ack_fpb(const struct ieee802154_config *config)
{
	int err = 0;
	stm32wba_802154_ral_error_t ret;

	if (config->ack_fpb.extended) {
		ret = stm32wba_802154_ral_pending_bit_for_ext_addr_clear(
						(const uint8_t *)config->ack_fpb.addr);
		if (ret != STM32WBA_802154_RAL_ERROR_NONE) {
			LOG_ERR("Failed to clear ACK_FPB for extended address: "
				"%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x",
				config->ack_fpb.addr[0], config->ack_fpb.addr[1],
				config->ack_fpb.addr[2], config->ack_fpb.addr[3],
				config->ack_fpb.addr[4], config->ack_fpb.addr[5],
				config->ack_fpb.addr[6], config->ack_fpb.addr[7]);
			err = -ENOENT;
		} else {
			LOG_DBG("Clear ACK_FPB for extended address: "
				"%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x",
				config->ack_fpb.addr[0], config->ack_fpb.addr[1],
				config->ack_fpb.addr[2], config->ack_fpb.addr[3],
				config->ack_fpb.addr[4], config->ack_fpb.addr[5],
				config->ack_fpb.addr[6], config->ack_fpb.addr[7]);
		}
	} else {
		uint16_t short_addr = (uint16_t)config->ack_fpb.addr[0] |
				     (uint16_t)(config->ack_fpb.addr[1] << 8);

