zephyrproject-rtos/zephyr/drivers/ieee802154/ieee802154_stm32wba.c
		ret = stm32wba_802154_ral_pending_bit_for_short_addr_clear(short_addr);
		if (ret != STM32WBA_802154_RAL_ERROR_NONE) {
			LOG_ERR("Failed to clear ACK_FPB for short address: 0x%02X%02X",
				config->ack_fpb.addr[1],
				config->ack_fpb.addr[0]);
			err = -ENOENT;
		} else {
			LOG_DBG("Clear ACK_FPB for short address: 0x%02X%02X",
				config->ack_fpb.addr[1],
				config->ack_fpb.addr[0]);
		}
	}
	return err;
}

static int stm32wba_802154_clear_all_ack_fpb(const struct ieee802154_config *config)
{
	if (config->ack_fpb.extended) {
		stm32wba_802154_ral_pending_bit_for_ext_addr_reset();
		LOG_DBG("Clear ACK_FPB for all extended addresses");
	} else {
		stm32wba_802154_ral_pending_bit_for_short_addr_reset();
		LOG_DBG("Clear ACK_FPB for all short addresses");
	}
	return 0;
}

static int stm32wba_802154_configure_ack_fpb(const struct ieee802154_config *config)
{
	int ret;

	if (config->ack_fpb.enabled) {
		/* Set ACK pending bit for an addr (short or extended) */
		ret = stm32wba_802154_set_ack_fpb(config);
	} else if (config->ack_fpb.addr != NULL) {
		/* Clear ACK pending bit for an addr (short or extended) */
		ret = stm32wba_802154_clear_ack_fpb(config);
	} else {
		/* Clear all ACK pending bit for addr (short or extended) */
		ret = stm32wba_802154_clear_all_ack_fpb(config);
	}

	return ret;
}

#if (SUPPORT_RADIO_SECURITY_OT_1_2 == 1)

static void stm32wba_802154_configure_mac_key(struct ieee802154_key *mac_keys)
{
	uint8_t aPrevKey[STM32WBA_MAC_KEY_SIZE] = {0};
	uint8_t aCurrKey[STM32WBA_MAC_KEY_SIZE] = {0};
	uint8_t aNextKey[STM32WBA_MAC_KEY_SIZE] = {0};
	uint8_t aKeyIdMode = 0;
	uint8_t aKeyId = 0;
	uint8_t *keys[] = {aPrevKey, aCurrKey, aNextKey};

	for (uint8_t i = 0; i < STM32WBA_MAC_KEYS_ENTRIES_MAX; mac_keys++, i++) {

		if (mac_keys->key_value == NULL) {
			break;
		}

		if (i == STM32WBA_MAC_KEY_CURR_INDEX) {
			aKeyIdMode = mac_keys->key_id_mode;
			aKeyId = *(mac_keys->key_id);
		}
		memcpy(keys[i], mac_keys->key_value, STM32WBA_MAC_KEY_SIZE);
	}

	stm32wba_802154_ral_set_mac_key(aKeyIdMode,
					aKeyId,
					aPrevKey,
					aCurrKey,
					aNextKey);
}
#endif /* SUPPORT_RADIO_SECURITY_OT_1_2 */

static int stm32wba_802154_configure(const struct device *dev,
				     enum ieee802154_config_type type,
				     const struct ieee802154_config *config)
{
	int ret = 0;

	ARG_UNUSED(dev);

	switch (type) {
	case IEEE802154_CONFIG_AUTO_ACK_FPB:
		LOG_DBG("Setting AUTO_ACK_FPB: enabled = %d", config->auto_ack_fpb.enabled);
		stm32wba_802154_ral_auto_pending_bit_set(config->auto_ack_fpb.enabled);
		break;

	case IEEE802154_CONFIG_ACK_FPB:
		ret = stm32wba_802154_configure_ack_fpb(config);
		break;

	case IEEE802154_CONFIG_PAN_COORDINATOR:
		LOG_DBG("Setting PAN_COORDINATOR: %d", config->pan_coordinator);
		stm32wba_802154_ral_pan_coord_set(config->pan_coordinator);
		break;

	case IEEE802154_CONFIG_PROMISCUOUS:
		LOG_DBG("Setting PROMISCUOUS mode: %d", config->promiscuous);
		stm32wba_802154_ral_promiscuous_set(config->promiscuous);
		break;

	case IEEE802154_CONFIG_EVENT_HANDLER:
		LOG_DBG("Setting EVENT_HANDLER");
		stm32wba_802154_data.event_handler = config->event_handler;
		break;

	case IEEE802154_CONFIG_RX_ON_WHEN_IDLE:
		LOG_DBG("Setting IEEE802154_CONFIG_RX_ON_WHEN_IDLE: enabled = %d",
			config->rx_on_when_idle);
		stm32wba_802154_data.rx_on_when_idle = config->rx_on_when_idle;
		stm32wba_802154_ral_set_continuous_reception(config->rx_on_when_idle);
		break;
#ifdef CONFIG_IEEE802154_STM32WBA_CSMA_CA_ENABLED
	case IEEE802154_CONFIG_CSMA_CA_BACKOFFS:
		LOG_DBG("Setting MAX_CSMA_BACKOFF: %u", config->csma_ca_backoffs);
		stm32wba_802154_ral_set_max_csma_backoff(config->csma_ca_backoffs);
		break;
#endif
#if (SUPPORT_RADIO_SECURITY_OT_1_2 == 1)
	case IEEE802154_CONFIG_FRAME_COUNTER_IF_LARGER:
		stm32wba_802154_ral_set_mac_frame_counter_if_larger(config->frame_counter);
		break;

	case IEEE802154_CONFIG_FRAME_COUNTER:
		stm32wba_802154_ral_set_mac_frame_counter(config->frame_counter);
		break;

	case IEEE802154_CONFIG_MAC_KEYS:
		stm32wba_802154_configure_mac_key(config->mac_keys);
		break;
#endif
	default:
#if defined(CONFIG_NET_L2_CUSTOM_IEEE802154)
		ret = stm32wba_802154_configure_extended(
					(enum ieee802154_stm32wba_config_type)type,
					(const struct ieee802154_stm32wba_config *)config);
#else
		LOG_ERR("Unsupported configuration type: %d", type);
		ret = -EINVAL;
#endif
	}

	return ret;
}

static int stm32wba_802154_attr_get(const struct device *dev,
				    enum ieee802154_attr attr,
				    struct ieee802154_attr_value *value)
{
	ARG_UNUSED(dev);

	if (ieee802154_attr_get_channel_page_and_range(
			attr, IEEE802154_ATTR_PHY_CHANNEL_PAGE_ZERO_OQPSK_2450_BPSK_868_915,
			&drv_attr.phy_supported_channels, value) == 0) {
		LOG_DBG("Attribute successfully retrieved for channel page and range");
		return 0;
	}

#if defined(CONFIG_NET_L2_CUSTOM_IEEE802154)
	return stm32wba_802154_attr_get_extended((enum ieee802154_stm32wba_attr)attr,
					  (struct ieee802154_stm32wba_attr_value *)value);
#else
	LOG_ERR("Unsupported attribute: %u", attr);
	return -ENOENT;
#endif
}

/* WBA radio driver callbacks */

static void stm32wba_802154_receive_done(uint8_t *p_buffer,
					 stm32wba_802154_ral_receive_done_metadata_t *p_metadata)
{
	if ((p_buffer == NULL) || (p_metadata->error != STM32WBA_802154_RAL_ERROR_NONE)) {
		stm32wba_802154_receive_failed(p_metadata->error);
		return;
	}

	for (uint32_t i = 0; i < ARRAY_SIZE(stm32wba_802154_data.rx_frames); i++) {
		if (stm32wba_802154_data.rx_frames[i].psdu != NULL) {
			continue;
		}

		stm32wba_802154_data.rx_frames[i].psdu = p_buffer;
		stm32wba_802154_data.rx_frames[i].length = p_metadata->length;
		stm32wba_802154_data.rx_frames[i].rssi = p_metadata->power;
		stm32wba_802154_data.rx_frames[i].lqi = p_metadata->lqi;
		stm32wba_802154_data.rx_frames[i].time = p_metadata->time;
		stm32wba_802154_data.rx_frames[i].ack_fpb =
							stm32wba_802154_data.last_frame_ack_fpb;
		stm32wba_802154_data.rx_frames[i].ack_seb =
							stm32wba_802154_data.last_frame_ack_seb;
		stm32wba_802154_data.last_frame_ack_fpb = false;
		stm32wba_802154_data.last_frame_ack_seb = false;

		k_fifo_put(&stm32wba_802154_data.rx_fifo, &stm32wba_802154_data.rx_frames[i]);

		return;
	}

	LOG_ERR("Not enough RX frames allocated for 802.15.4 driver");
}

void stm32wba_802154_tx_ack_started(bool ack_fpb, bool ack_seb)
{
	stm32wba_802154_data.last_frame_ack_fpb = ack_fpb;
	stm32wba_802154_data.last_frame_ack_seb = ack_seb;
}

static void stm32wba_802154_transmit_done(
				uint8_t *p_frame,
				stm32wba_802154_ral_error_t error,
				const stm32wba_802154_ral_transmit_done_metadata_t *p_metadata)
{
	ARG_UNUSED(p_frame);

