zephyrproject-rtos/zephyr/drivers/ieee802154/ieee802154_stm32wba.c
	/* Ignore stale completion after reset, or completion with no active waiter. */
	if (stm32wba_tx_abort_on_reset || !stm32wba_tx_wait_pending) {
		return;
	}

	if (p_frame != NULL) {
		memcpy(stm32wba_802154_data.tx_psdu, p_frame, stm32wba_802154_data.tx_psdu_len);
		stm32wba_802154_data.tx_psdu_from_tx_done = true;
	} else {
		stm32wba_802154_data.tx_psdu_from_tx_done = false;
	}

	stm32wba_802154_data.tx_result = error;
	stm32wba_802154_data.tx_frame_is_secured = p_metadata->is_secured;
	stm32wba_802154_data.tx_frame_mac_hdr_rdy = p_metadata->dynamic_data_is_set;
	stm32wba_802154_data.ack_frame.length = p_metadata->length;

	if (stm32wba_802154_data.ack_frame.length != 0) {
		stm32wba_802154_data.ack_frame.psdu = p_metadata->p_ack;
		stm32wba_802154_data.ack_frame.rssi = p_metadata->power;
		stm32wba_802154_data.ack_frame.lqi = p_metadata->lqi;
	} else {
		stm32wba_802154_data.ack_frame.psdu = NULL;
		stm32wba_802154_data.ack_frame.rssi = 0;
		stm32wba_802154_data.ack_frame.lqi = 0;
	}

	k_sem_give(&stm32wba_802154_data.tx_wait);
}

static void stm32wba_802154_cca_done(stm32wba_802154_ral_error_t error)
{
	if (error == STM32WBA_802154_RAL_ERROR_NONE) {
		stm32wba_802154_data.channel_free = true;
	}

	k_sem_give(&stm32wba_802154_data.cca_wait);
}

static int8_t stm32wba_802154_convert_ed_to_rssi(uint8_t ed_result)
{
	int8_t rssi_result;

	if (ed_result == 0xFF) {
		/*  Max dBm */
		rssi_result = DEFAULT_MAX_ED;
	} else if (ed_result == 0) {
		/* Min dBm */
		rssi_result = DEFAULT_MIN_ED;
	} else {
		rssi_result = (((uint32_t)(ed_result * 5) >> 5) + DEFAULT_MIN_ED);
	}

	return rssi_result;
}

static void stm32wba_802154_energy_scan_done(int8_t ed_result)
{
	if (stm32wba_802154_data.energy_scan_done_cb != NULL) {
		energy_scan_done_cb_t callback = stm32wba_802154_data.energy_scan_done_cb;
		int8_t rssi_result;

		/* Convert the normalized energy detected in dBm */
		rssi_result = stm32wba_802154_convert_ed_to_rssi((uint8_t)ed_result);

		stm32wba_802154_data.energy_scan_done_cb = NULL;
		callback(stm32wba_802154_get_device(), rssi_result);
	}
}

#ifdef CONFIG_PM_DEVICE
static int radio_pm_action(const struct device *dev, enum pm_device_action action)
{
	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		LL_AHB5_GRP1_EnableClock(LL_AHB5_GRP1_PERIPH_RADIO);
#if defined(CONFIG_PM_S2RAM)
		if (ll_sys_dp_slp_get_state() == LL_SYS_DP_SLP_ENABLED) {
			if (standby_entered) {
				/* Restore NVIC configuration for radio */
				link_layer_register_isr();
				ll_sys_dp_slp_exit();
			}
		}
#endif /* CONFIG_PM_S2RAM */
		LINKLAYER_PLAT_NotifyWFIExit();
		break;
	case PM_DEVICE_ACTION_SUSPEND:
#if defined(CONFIG_PM_S2RAM)
		if (ll_sys_dp_slp_get_state() == LL_SYS_DP_SLP_DISABLED) {
			uint64_t next_radio_evt;
			enum pm_state state = pm_state_next_get(_current_cpu->id)->state;

			if (state == PM_STATE_SUSPEND_TO_RAM) {
				next_radio_evt = os_timer_get_earliest_time();
				if (next_radio_evt > CFG_LPM_STDBY_WAKEUP_TIME) {
					/* No event in a "near" futur */
					next_radio_evt -= CFG_LPM_STDBY_WAKEUP_TIME;
					ll_sys_dp_slp_enter(next_radio_evt);
				}
			}
		}
#endif /* CONFIG_PM_S2RAM */
		LINKLAYER_PLAT_NotifyWFIEnter();
		break;
	default:
		return -ENOTSUP;
	}

	return 0;
}

PM_DEVICE_DT_INST_DEFINE(0, radio_pm_action);
#endif /* CONFIG_PM_DEVICE */

static const struct ieee802154_radio_api stm32wba_802154_radio_api = {
	.iface_api.init = stm32wba_802154_iface_init,
	.get_capabilities = stm32wba_802154_get_capabilities,
	.cca = stm32wba_802154_cca,
	.set_channel = stm32wba_802154_set_channel,
	.filter = stm32wba_802154_filter,
	.set_txpower = stm32wba_802154_set_txpower,
	.start = stm32wba_802154_start,
	.stop = stm32wba_802154_stop,
	.tx = stm32wba_802154_tx,
	.ed_scan = stm32wba_802154_energy_scan_start,
	.get_time = stm32wba_802154_get_time,
	.get_sch_acc = stm32wba_802154_get_acc,
	.configure = stm32wba_802154_configure,
	.attr_get = stm32wba_802154_attr_get,
};

#if defined(CONFIG_NET_L2_IEEE802154)
#define L2		IEEE802154_L2
#define L2_CTX_TYPE	NET_L2_GET_CTX_TYPE(IEEE802154_L2)
#define MTU		IEEE802154_MTU
#elif defined(CONFIG_NET_L2_OPENTHREAD)
#define L2		OPENTHREAD_L2
#define L2_CTX_TYPE	NET_L2_GET_CTX_TYPE(OPENTHREAD_L2)
#define MTU		1280
#elif defined(CONFIG_NET_L2_CUSTOM_IEEE802154)
#define L2		CUSTOM_IEEE802154_L2
#define L2_CTX_TYPE	NET_L2_GET_CTX_TYPE(CUSTOM_IEEE802154_L2)
#define MTU		CONFIG_NET_L2_CUSTOM_IEEE802154_MTU
#endif

#if defined(CONFIG_NET_L2_PHY_IEEE802154)
NET_DEVICE_DT_INST_DEFINE(0,
			  stm32wba_802154_driver_init,
			  PM_DEVICE_DT_INST_GET(0),
			  &stm32wba_802154_data,
			  NULL,
			  CONFIG_IEEE802154_STM32WBA_INIT_PRIO,
			  &stm32wba_802154_radio_api,
			  L2,
			  L2_CTX_TYPE,
			  MTU);
#else
DEVICE_DT_INST_DEFINE(0,
		      stm32wba_802154_driver_init,
		      PM_DEVICE_DT_INST_GET(0),
		      &stm32wba_802154_data,
		      NULL,
		      POST_KERNEL,
		      CONFIG_IEEE802154_STM32WBA_INIT_PRIO,
		      &stm32wba_802154_radio_api);
#endif
